; ModuleID = 'UnitTestMain/TestMain.cpp'
source_filename = "UnitTestMain/TestMain.cpp"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"class.testing::UnitTest" = type { i32 (...)**, %"class.testing::internal::Mutex", %"class.testing::internal::UnitTestImpl"* }
%"class.testing::internal::Mutex" = type { %"class.testing::internal::MutexBase" }
%"class.testing::internal::MutexBase" = type { %struct._opaque_pthread_mutex_t, %struct._opaque_pthread_t* }
%struct._opaque_pthread_mutex_t = type { i64, [56 x i8] }
%struct._opaque_pthread_t = type { i64, %struct.__darwin_pthread_handler_rec*, [8176 x i8] }
%struct.__darwin_pthread_handler_rec = type { void (i8*)*, i8*, %struct.__darwin_pthread_handler_rec* }
%"class.testing::internal::UnitTestImpl" = type opaque

@__dso_handle = global i8* null, align 8
@.str = private unnamed_addr constant [18 x i8] c"gtest result: %d\0A\00", align 1

; Function Attrs: norecurse nounwind ssp uwtable
define i32 @main(i32, i8**) #0 !dbg !951 {
  %3 = alloca i32, align 4
  %4 = alloca i32, align 4
  %5 = alloca i8**, align 8
  %6 = alloca i32, align 4
  store i32 0, i32* %3, align 4
  store i32 %0, i32* %4, align 4
  call void @llvm.dbg.declare(metadata i32* %4, metadata !954, metadata !955), !dbg !956
  store i8** %1, i8*** %5, align 8
  call void @llvm.dbg.declare(metadata i8*** %5, metadata !957, metadata !955), !dbg !958
  %7 = load i8**, i8*** %5, align 8, !dbg !959

!48 = !DISubprogram(name: "memcmp", scope: !24, file: !24, line: 71, type: !49, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !27, !27, !15}
!51 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!52 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !53, line: 77)
!53 = !DISubprogram(name: "strcmp", scope: !24, file: !24, line: 77, type: !54, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!54 = !DISubroutineType(types: !55)
!55 = !{!51, !37, !37}
!56 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !57, line: 78)
!57 = !DISubprogram(name: "strncmp", scope: !24, file: !24, line: 84, type: !58, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!58 = !DISubroutineType(types: !59)
!59 = !{!51, !37, !37, !15}
!60 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !61, line: 79)
!61 = !DISubprogram(name: "strcoll", scope: !24, file: !24, line: 78, type: !54, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!62 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !63, line: 80)
!63 = !DISubprogram(name: "strxfrm", scope: !24, file: !24, line: 91, type: !64, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!64 = !DISubroutineType(types: !65)
!65 = !{!15, !35, !37, !15}
!66 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !67, line: 81)
!67 = !DISubprogram(name: "memchr", linkageName: "_Z6memchrUa9enable_ifIXLb1EEEPvim", scope: !68, file: !68, line: 99, type: !69, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!68 = !DIFile(filename: "/usr/local/Cellar/llvm/3.9.1/bin/../include/c++/v1/string.h", directory: "/Users/Stanislaw/Projects/LLVM/llvm/projects/mutang-project/lab/google_test/test_finder")
!69 = !DISubroutineType(types: !70)
!70 = !{!5, !5, !51, !15}
!71 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !72, line: 82)
!72 = !DISubprogram(name: "strchr", linkageName: "_Z6strchrUa9enable_ifIXLb1EEEPci", scope: !68, file: !68, line: 78, type: !73, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!73 = !DISubroutineType(types: !74)
!74 = !{!35, !35, !51}
!75 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !76, line: 83)
!76 = !DISubprogram(name: "strcspn", scope: !24, file: !24, line: 80, type: !77, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!77 = !DISubroutineType(types: !78)
!78 = !{!15, !37, !37}
!79 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !80, line: 84)
!80 = !DISubprogram(name: "strpbrk", linkageName: "_Z7strpbrkUa9enable_ifIXLb1EEEPcPKc", scope: !68, file: !68, line: 85, type: !33, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!81 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !82, line: 85)
!82 = !DISubprogram(name: "strrchr", linkageName: "_Z7strrchrUa9enable_ifIXLb1EEEPci", scope: !68, file: !68, line: 92, type: !73, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!83 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !84, line: 86)
!84 = !DISubprogram(name: "strspn", scope: !24, file: !24, line: 88, type: !77, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!85 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !86, line: 87)
!86 = !DISubprogram(name: "strstr", linkageName: "_Z6strstrUa9enable_ifIXLb1EEEPcPKc", scope: !68, file: !68, line: 106, type: !33, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!87 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !88, line: 89)
!88 = !DISubprogram(name: "strtok", scope: !24, file: !24, line: 90, type: !33, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!89 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !90, line: 91)
!90 = !DISubprogram(name: "memset", scope: !24, file: !24, line: 74, type: !69, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!91 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !92, line: 92)
!92 = !DISubprogram(name: "strerror", linkageName: "\01_strerror", scope: !24, file: !24, line: 81, type: !93, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!93 = !DISubroutineType(types: !94)
!94 = !{!35, !51}
!95 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !96, line: 93)
!96 = !DISubprogram(name: "strlen", scope: !24, file: !24, line: 82, type: !97, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!97 = !DISubroutineType(types: !98)
!98 = !{!15, !37}
!99 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !100, line: 108)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !101, line: 153, baseType: !102)
!101 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/Stanislaw/Projects/LLVM/llvm/projects/mutang-project/lab/google_test/test_finder")
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !101, line: 122, size: 1216, align: 64, elements: !103, identifier: "_ZTS7__sFILE")
!103 = !{!104, !107, !108, !109, !111, !112, !117, !118, !119, !123, !127, !137, !141, !142, !145, !146, !150, !154, !155, !156}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !102, file: !101, line: 123, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !102, file: !101, line: 124, baseType: !51, size: 32, align: 32, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !102, file: !101, line: 125, baseType: !51, size: 32, align: 32, offset: 96)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !102, file: !101, line: 126, baseType: !110, size: 16, align: 16, offset: 128)
!110 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !102, file: !101, line: 127, baseType: !110, size: 16, align: 16, offset: 144)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !102, file: !101, line: 128, baseType: !113, size: 128, align: 64, offset: 192)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !101, line: 88, size: 128, align: 64, elements: !114, identifier: "_ZTS6__sbuf")
!114 = !{!115, !116}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !113, file: !101, line: 89, baseType: !105, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !113, file: !101, line: 90, baseType: !51, size: 32, align: 32, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !102, file: !101, line: 129, baseType: !51, size: 32, align: 32, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !102, file: !101, line: 132, baseType: !5, size: 64, align: 64, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !102, file: !101, line: 133, baseType: !120, size: 64, align: 64, offset: 448)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!51, !5}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !102, file: !101, line: 134, baseType: !124, size: 64, align: 64, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!51, !5, !35, !51}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !102, file: !101, line: 135, baseType: !128, size: 64, align: 64, offset: 576)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!131, !5, !131, !51}
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !101, line: 77, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !133, line: 71, baseType: !134)
!133 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/Stanislaw/Projects/LLVM/llvm/projects/mutang-project/lab/google_test/test_finder")
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !135, line: 46, baseType: !136)
!135 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/Stanislaw/Projects/LLVM/llvm/projects/mutang-project/lab/google_test/test_finder")
!136 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !102, file: !101, line: 136, baseType: !138, size: 64, align: 64, offset: 640)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!51, !5, !37, !51}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !102, file: !101, line: 139, baseType: !113, size: 128, align: 64, offset: 704)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !102, file: !101, line: 140, baseType: !143, size: 64, align: 64, offset: 832)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !101, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !102, file: !101, line: 141, baseType: !51, size: 32, align: 32, offset: 896)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !102, file: !101, line: 144, baseType: !147, size: 24, align: 8, offset: 928)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 24, align: 8, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 3)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !102, file: !101, line: 145, baseType: !151, size: 8, align: 8, offset: 952)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 8, align: 8, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 1)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !102, file: !101, line: 148, baseType: !113, size: 128, align: 64, offset: 960)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !102, file: !101, line: 151, baseType: !51, size: 32, align: 32, offset: 1088)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !102, file: !101, line: 152, baseType: !131, size: 64, align: 64, offset: 1152)
!157 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !131, line: 109)
!158 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !15, line: 110)
!159 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !160, line: 112)
!160 = !DISubprogram(name: "fclose", scope: !101, file: !101, line: 232, type: !161, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!161 = !DISubroutineType(types: !162)
!162 = !{!51, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!164 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !165, line: 113)
!165 = !DISubprogram(name: "fflush", scope: !101, file: !101, line: 235, type: !161, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!166 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !167, line: 114)
!167 = !DISubprogram(name: "setbuf", scope: !101, file: !101, line: 267, type: !168, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !163, !35}
!170 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !171, line: 115)
!171 = !DISubprogram(name: "setvbuf", scope: !101, file: !101, line: 268, type: !172, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!172 = !DISubroutineType(types: !173)
!173 = !{!51, !163, !35, !51, !15}
!174 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !175, line: 116)
!175 = !DISubprogram(name: "fprintf", scope: !101, file: !101, line: 244, type: !176, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!176 = !DISubroutineType(types: !177)
!177 = !{!51, !163, !37, null}
!178 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !179, line: 117)
!179 = !DISubprogram(name: "fscanf", scope: !101, file: !101, line: 250, type: !176, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!180 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !181, line: 118)
!181 = !DISubprogram(name: "snprintf", scope: !101, file: !101, line: 421, type: !182, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!182 = !DISubroutineType(types: !183)
!183 = !{!51, !35, !15, !37, null}
!184 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !185, line: 119)
!185 = !DISubprogram(name: "sprintf", scope: !101, file: !101, line: 269, type: !186, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!186 = !DISubroutineType(types: !187)
!187 = !{!51, !35, !37, null}
!188 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !189, line: 120)
!189 = !DISubprogram(name: "sscanf", scope: !101, file: !101, line: 270, type: !190, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!190 = !DISubroutineType(types: !191)
!191 = !{!51, !37, !37, null}
!192 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !193, line: 122)
!193 = !DISubprogram(name: "vfprintf", scope: !101, file: !101, line: 278, type: !194, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!194 = !DISubroutineType(types: !195)
!195 = !{!51, !163, !37, !196}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !198, identifier: "_ZTS13__va_list_tag")
!198 = !{!199, !201, !202, !203}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !197, file: !1, baseType: !200, size: 32, align: 32)
!200 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !197, file: !1, baseType: !200, size: 32, align: 32, offset: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !197, file: !1, baseType: !5, size: 64, align: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !197, file: !1, baseType: !5, size: 64, align: 64, offset: 128)
!204 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !205, line: 123)
!205 = !DISubprogram(name: "vfscanf", scope: !101, file: !101, line: 422, type: !194, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!206 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !207, line: 124)
!207 = !DISubprogram(name: "vsscanf", scope: !101, file: !101, line: 425, type: !208, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!208 = !DISubroutineType(types: !209)
!209 = !{!51, !37, !37, !196}
!210 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !211, line: 126)
!211 = !DISubprogram(name: "vsnprintf", scope: !101, file: !101, line: 424, type: !212, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!212 = !DISubroutineType(types: !213)
!213 = !{!51, !35, !15, !37, !196}
!214 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !215, line: 127)
!215 = !DISubprogram(name: "vsprintf", scope: !101, file: !101, line: 280, type: !216, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!216 = !DISubroutineType(types: !217)
!217 = !{!51, !35, !37, !196}
!218 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !219, line: 128)
!219 = !DISubprogram(name: "fgetc", scope: !101, file: !101, line: 236, type: !161, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!220 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !221, line: 129)
!221 = !DISubprogram(name: "fgets", scope: !101, file: !101, line: 238, type: !222, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!222 = !DISubroutineType(types: !223)
!223 = !{!35, !35, !51, !163}
!224 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !225, line: 130)
!225 = !DISubprogram(name: "fputc", scope: !101, file: !101, line: 245, type: !226, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!226 = !DISubroutineType(types: !227)
!227 = !{!51, !51, !163}
!228 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !229, line: 131)
!229 = !DISubprogram(name: "fputs", linkageName: "\01_fputs", scope: !101, file: !101, line: 246, type: !230, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!230 = !DISubroutineType(types: !231)
!231 = !{!51, !37, !163}
!232 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !233, line: 132)
!233 = !DISubprogram(name: "getc", scope: !101, file: !101, line: 255, type: !161, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!234 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !235, line: 133)
!235 = !DISubprogram(name: "putc", scope: !101, file: !101, line: 260, type: !226, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!236 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !237, line: 134)
!237 = !DISubprogram(name: "ungetc", scope: !101, file: !101, line: 277, type: !226, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!238 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !239, line: 135)
!239 = !DISubprogram(name: "fread", scope: !101, file: !101, line: 247, type: !240, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!240 = !DISubroutineType(types: !241)
!241 = !{!15, !5, !15, !15, !163}
!242 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !243, line: 136)
!243 = !DISubprogram(name: "fwrite", linkageName: "\01_fwrite", scope: !101, file: !101, line: 254, type: !244, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!244 = !DISubroutineType(types: !245)
!245 = !{!15, !27, !15, !15, !163}
!246 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !247, line: 137)
!247 = !DISubprogram(name: "fgetpos", scope: !101, file: !101, line: 237, type: !248, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!248 = !DISubroutineType(types: !249)
!249 = !{!51, !163, !250}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!251 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !252, line: 138)
!252 = !DISubprogram(name: "fseek", scope: !101, file: !101, line: 251, type: !253, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!253 = !DISubroutineType(types: !254)
!254 = !{!51, !163, !13, !51}
!255 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !256, line: 139)
!256 = !DISubprogram(name: "fsetpos", scope: !101, file: !101, line: 252, type: !257, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!257 = !DISubroutineType(types: !258)
!258 = !{!51, !163, !259}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!261 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !262, line: 140)
!262 = !DISubprogram(name: "ftell", scope: !101, file: !101, line: 253, type: !263, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!263 = !DISubroutineType(types: !264)
!264 = !{!13, !163}
!265 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !266, line: 141)
!266 = !DISubprogram(name: "rewind", scope: !101, file: !101, line: 265, type: !267, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !163}
!269 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !270, line: 142)
!270 = !DISubprogram(name: "clearerr", scope: !101, file: !101, line: 231, type: !267, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!271 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !272, line: 143)
!272 = !DISubprogram(name: "feof", scope: !101, file: !101, line: 233, type: !161, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!273 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !274, line: 144)
!274 = !DISubprogram(name: "ferror", scope: !101, file: !101, line: 234, type: !161, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!275 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !276, line: 145)
!276 = !DISubprogram(name: "perror", scope: !101, file: !101, line: 258, type: !277, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !37}
!279 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !280, line: 148)
!280 = !DISubprogram(name: "fopen", linkageName: "\01_fopen", scope: !101, file: !101, line: 242, type: !281, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!281 = !DISubroutineType(types: !282)
!282 = !{!163, !37, !37}
!283 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !284, line: 149)
!284 = !DISubprogram(name: "freopen", linkageName: "\01_freopen", scope: !101, file: !101, line: 248, type: !285, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!285 = !DISubroutineType(types: !286)
!286 = !{!163, !37, !37, !163}
!287 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !288, line: 150)
!288 = !DISubprogram(name: "remove", scope: !101, file: !101, line: 263, type: !289, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!289 = !DISubroutineType(types: !290)
!290 = !{!51, !37}
!291 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !292, line: 151)
!292 = !DISubprogram(name: "rename", scope: !101, file: !101, line: 264, type: !54, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!293 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !294, line: 152)
!294 = !DISubprogram(name: "tmpfile", scope: !101, file: !101, line: 271, type: !295, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!295 = !DISubroutineType(types: !296)
!296 = !{!163}
!297 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !298, line: 153)
!298 = !DISubprogram(name: "tmpnam", scope: !101, file: !101, line: 276, type: !299, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!299 = !DISubroutineType(types: !300)
!300 = !{!35, !35}
!301 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !302, line: 157)
!302 = !DISubprogram(name: "getchar", scope: !101, file: !101, line: 256, type: !303, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!303 = !DISubroutineType(types: !304)
!304 = !{!51}
!305 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !306, line: 159)
!306 = !DISubprogram(name: "gets", scope: !101, file: !101, line: 257, type: !299, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!307 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !308, line: 161)
!308 = !DISubprogram(name: "scanf", scope: !101, file: !101, line: 266, type: !309, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!309 = !DISubroutineType(types: !310)
!310 = !{!51, !37, null}
!311 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !312, line: 162)
!312 = !DISubprogram(name: "vscanf", scope: !101, file: !101, line: 423, type: !313, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!313 = !DISubroutineType(types: !314)
!314 = !{!51, !37, !196}
!315 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !316, line: 166)
!316 = !DISubprogram(name: "printf", scope: !101, file: !101, line: 259, type: !309, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!317 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !318, line: 167)
!318 = !DISubprogram(name: "putchar", scope: !101, file: !101, line: 261, type: !319, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!319 = !DISubroutineType(types: !320)
!320 = !{!51, !51}
!321 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !322, line: 168)
!322 = !DISubprogram(name: "puts", scope: !101, file: !101, line: 262, type: !289, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!323 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !324, line: 169)
!324 = !DISubprogram(name: "vprintf", scope: !101, file: !101, line: 279, type: !313, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!325 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !15, line: 94)
!326 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !327, line: 95)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !328, line: 85, baseType: !329)
!328 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/Stanislaw/Projects/LLVM/llvm/projects/mutang-project/lab/google_test/test_finder")
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !328, line: 82, size: 64, align: 32, elements: !330, identifier: "_ZTS5div_t")
!330 = !{!331, !332}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !329, file: !328, line: 83, baseType: !51, size: 32, align: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !329, file: !328, line: 84, baseType: !51, size: 32, align: 32, offset: 32)
!333 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !334, line: 96)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !328, line: 90, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !328, line: 87, size: 128, align: 64, elements: !336, identifier: "_ZTS6ldiv_t")
!336 = !{!337, !338}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !335, file: !328, line: 88, baseType: !13, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !335, file: !328, line: 89, baseType: !13, size: 64, align: 64, offset: 64)
!339 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !340, line: 98)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !328, line: 96, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !328, line: 93, size: 128, align: 64, elements: !342, identifier: "_ZTS7lldiv_t")
!342 = !{!343, !344}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !341, file: !328, line: 94, baseType: !136, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !341, file: !328, line: 95, baseType: !136, size: 64, align: 64, offset: 64)
!345 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !346, line: 100)
!346 = !DISubprogram(name: "atof", scope: !328, file: !328, line: 131, type: !347, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!347 = !DISubroutineType(types: !348)
!348 = !{!349, !37}
!349 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!350 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !351, line: 101)
!351 = !DISubprogram(name: "atoi", scope: !328, file: !328, line: 132, type: !289, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!352 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !353, line: 102)
!353 = !DISubprogram(name: "atol", scope: !328, file: !328, line: 133, type: !354, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!354 = !DISubroutineType(types: !355)
!355 = !{!13, !37}
!356 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !357, line: 104)
!357 = !DISubprogram(name: "atoll", scope: !328, file: !328, line: 136, type: !358, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!358 = !DISubroutineType(types: !359)
!359 = !{!136, !37}
!360 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !361, line: 106)
!361 = !DISubprogram(name: "strtod", linkageName: "\01_strtod", scope: !328, file: !328, line: 162, type: !362, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!362 = !DISubroutineType(types: !363)
!363 = !{!349, !37, !364}
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!365 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !366, line: 107)
!366 = !DISubprogram(name: "strtof", linkageName: "\01_strtof", scope: !328, file: !328, line: 163, type: !367, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!367 = !DISubroutineType(types: !368)
!368 = !{!369, !37, !364}
!369 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!370 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !371, line: 108)
!371 = !DISubprogram(name: "strtold", scope: !328, file: !328, line: 166, type: !372, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!372 = !DISubroutineType(types: !373)
!373 = !{!20, !37, !364}
!374 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !375, line: 109)
!375 = !DISubprogram(name: "strtol", scope: !328, file: !328, line: 164, type: !376, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!376 = !DISubroutineType(types: !377)
!377 = !{!13, !37, !364, !51}
!378 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !379, line: 111)
!379 = !DISubprogram(name: "strtoll", scope: !328, file: !328, line: 169, type: !380, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!380 = !DISubroutineType(types: !381)
!381 = !{!136, !37, !364, !51}
!382 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !383, line: 113)
!383 = !DISubprogram(name: "strtoul", scope: !328, file: !328, line: 172, type: !384, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!384 = !DISubroutineType(types: !385)
!385 = !{!16, !37, !364, !51}
!386 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !387, line: 115)
!387 = !DISubprogram(name: "strtoull", scope: !328, file: !328, line: 175, type: !388, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!388 = !DISubroutineType(types: !389)
!389 = !{!390, !37, !364, !51}
!390 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!391 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !392, line: 117)
!392 = !DISubprogram(name: "rand", scope: !328, file: !328, line: 159, type: !303, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!393 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !394, line: 118)
!394 = !DISubprogram(name: "srand", scope: !328, file: !328, line: 161, type: !395, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!395 = !DISubroutineType(types: !396)
!396 = !{null, !200}
!397 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !398, line: 119)
!398 = !DISubprogram(name: "calloc", scope: !328, file: !328, line: 140, type: !399, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!399 = !DISubroutineType(types: !400)
!400 = !{!5, !15, !15}
!401 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !402, line: 120)
!402 = !DISubprogram(name: "free", scope: !328, file: !328, line: 143, type: !403, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!403 = !DISubroutineType(types: !404)
!404 = !{null, !5}
!405 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !406, line: 121)
!406 = !DISubprogram(name: "malloc", scope: !328, file: !328, line: 152, type: !407, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!407 = !DISubroutineType(types: !408)
!408 = !{!5, !15}
!409 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !410, line: 122)
!410 = !DISubprogram(name: "realloc", scope: !328, file: !328, line: 160, type: !411, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!411 = !DISubroutineType(types: !412)
!412 = !{!5, !5, !15}
!413 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !414, line: 123)
!414 = !DISubprogram(name: "abort", scope: !328, file: !328, line: 128, type: !415, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!415 = !DISubroutineType(types: !416)
!416 = !{null}
!417 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !418, line: 124)
!418 = !DISubprogram(name: "atexit", scope: !328, file: !328, line: 130, type: !419, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!419 = !DISubroutineType(types: !420)
!420 = !{!51, !421}
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!422 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !423, line: 125)
!423 = !DISubprogram(name: "exit", scope: !328, file: !328, line: 142, type: !424, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!424 = !DISubroutineType(types: !425)
!425 = !{null, !51}
!426 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !427, line: 126)
!427 = !DISubprogram(name: "_Exit", scope: !328, file: !328, line: 182, type: !424, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!428 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !429, line: 127)
!429 = !DISubprogram(name: "getenv", scope: !328, file: !328, line: 144, type: !430, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!430 = !DISubroutineType(types: !431)
!431 = !{!35, !37}
!432 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !433, line: 128)
!433 = !DISubprogram(name: "system", linkageName: "\01_system", scope: !328, file: !328, line: 177, type: !289, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!434 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !435, line: 129)
!435 = !DISubprogram(name: "bsearch", scope: !328, file: !328, line: 138, type: !436, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!436 = !DISubroutineType(types: !437)
!437 = !{!5, !27, !27, !15, !15, !438}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64, align: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!51, !27, !27}
!441 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !442, line: 130)
!442 = !DISubprogram(name: "qsort", scope: !328, file: !328, line: 157, type: !443, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!443 = !DISubroutineType(types: !444)
!444 = !{null, !5, !15, !15, !438}
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !446, line: 131)
!446 = !DISubprogram(name: "abs", linkageName: "_Z3absx", scope: !447, file: !447, line: 117, type: !448, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!447 = !DIFile(filename: "/usr/local/Cellar/llvm/3.9.1/bin/../include/c++/v1/stdlib.h", directory: "/Users/Stanislaw/Projects/LLVM/llvm/projects/mutang-project/lab/google_test/test_finder")
!448 = !DISubroutineType(types: !449)
!449 = !{!136, !136}
!450 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !451, line: 132)
!451 = !DISubprogram(name: "labs", scope: !328, file: !328, line: 145, type: !452, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!452 = !DISubroutineType(types: !453)
!453 = !{!13, !13}
!454 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !455, line: 134)
!455 = !DISubprogram(name: "llabs", scope: !328, file: !328, line: 149, type: !448, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!456 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !457, line: 136)
!457 = !DISubprogram(name: "div", linkageName: "_Z3divxx", scope: !447, file: !447, line: 122, type: !458, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!458 = !DISubroutineType(types: !459)
!459 = !{!340, !136, !136}
!460 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !461, line: 137)
!461 = !DISubprogram(name: "ldiv", scope: !328, file: !328, line: 146, type: !462, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!462 = !DISubroutineType(types: !463)
!463 = !{!334, !13, !13}
!464 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !465, line: 139)
!465 = !DISubprogram(name: "lldiv", scope: !328, file: !328, line: 150, type: !458, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!466 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !467, line: 142)
!467 = !DISubprogram(name: "mblen", scope: !328, file: !328, line: 153, type: !468, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!468 = !DISubroutineType(types: !469)
!469 = !{!51, !37, !15}
!470 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !471, line: 143)
!471 = !DISubprogram(name: "mbtowc", scope: !328, file: !328, line: 155, type: !472, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!472 = !DISubroutineType(types: !473)
!473 = !{!51, !474, !37, !15}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64, align: 64)
!475 = !DIBasicType(name: "wchar_t", size: 32, align: 32, encoding: DW_ATE_signed)
!476 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !477, line: 144)
!477 = !DISubprogram(name: "wctomb", scope: !328, file: !328, line: 179, type: !478, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!478 = !DISubroutineType(types: !479)
!479 = !{!51, !35, !475}
!480 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !481, line: 146)
!481 = !DISubprogram(name: "mbstowcs", scope: !328, file: !328, line: 154, type: !482, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!482 = !DISubroutineType(types: !483)
!483 = !{!15, !474, !37, !15}
!484 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !485, line: 147)
!485 = !DISubprogram(name: "wcstombs", scope: !328, file: !328, line: 178, type: !486, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!486 = !DISubroutineType(types: !487)
!487 = !{!15, !35, !488, !15}
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !475)
!490 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !491, line: 153)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !492, line: 30, baseType: !493)
!492 = !DIFile(filename: "/usr/include/sys/_types/_int8_t.h", directory: "/Users/Stanislaw/Projects/LLVM/llvm/projects/mutang-project/lab/google_test/test_finder")
!493 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!494 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !495, line: 154)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !496, line: 30, baseType: !110)
!496 = !DIFile(filename: "/usr/include/sys/_types/_int16_t.h", directory: "/Users/Stanislaw/Projects/LLVM/llvm/projects/mutang-project/lab/google_test/test_finder")
!497 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !498, line: 155)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !499, line: 30, baseType: !51)
!499 = !DIFile(filename: "/usr/include/sys/_types/_int32_t.h", directory: "/Users/Stanislaw/Projects/LLVM/llvm/projects/mutang-project/lab/google_test/test_finder")
!500 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !501, line: 156)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !502, line: 30, baseType: !136)
!502 = !DIFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/Stanislaw/Projects/LLVM/llvm/projects/mutang-project/lab/google_test/test_finder")
!503 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !504, line: 158)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !505, line: 31, baseType: !106)
!505 = !DIFile(filename: "/usr/include/_types/_uint8_t.h", directory: "/Users/Stanislaw/Projects/LLVM/llvm/projects/mutang-project/lab/google_test/test_finder")
!506 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !507, line: 159)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !508, line: 31, baseType: !509)
!508 = !DIFile(filename: "/usr/include/_types/_uint16_t.h", directory: "/Users/Stanislaw/Projects/LLVM/llvm/projects/mutang-project/lab/google_test/test_finder")
!509 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!510 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !511, line: 160)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !512, line: 31, baseType: !200)
!512 = !DIFile(filename: "/usr/include/_types/_uint32_t.h", directory: "/Users/Stanislaw/Projects/LLVM/llvm/projects/mutang-project/lab/google_test/test_finder")
!513 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !514, line: 161)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !515, line: 31, baseType: !390)
!515 = !DIFile(filename: "/usr/include/_types/_uint64_t.h", directory: "/Users/Stanislaw/Projects/LLVM/llvm/projects/mutang-project/lab/google_test/test_finder")
!516 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !517, line: 163)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !518, line: 29, baseType: !491)
!518 = !DIFile(filename: "/usr/include/stdint.h", directory: "/Users/Stanislaw/Projects/LLVM/llvm/projects/mutang-project/lab/google_test/test_finder")
!519 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !520, line: 164)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !518, line: 30, baseType: !495)
!521 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !522, line: 165)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !518, line: 31, baseType: !498)
!523 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !524, line: 166)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !518, line: 32, baseType: !501)
!525 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !526, line: 168)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !518, line: 33, baseType: !504)
!527 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !528, line: 169)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !518, line: 34, baseType: !507)
!529 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !530, line: 170)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !518, line: 35, baseType: !511)
!531 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !532, line: 171)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !518, line: 36, baseType: !514)
!533 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !534, line: 173)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !518, line: 40, baseType: !491)
!535 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !536, line: 174)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !518, line: 41, baseType: !495)
!537 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !538, line: 175)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !518, line: 42, baseType: !498)
!539 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !540, line: 176)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !518, line: 43, baseType: !501)
!541 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !542, line: 178)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !518, line: 44, baseType: !504)
!543 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !544, line: 179)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !518, line: 45, baseType: !507)
!545 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !546, line: 180)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !518, line: 46, baseType: !511)
!547 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !548, line: 181)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !518, line: 47, baseType: !514)
!549 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !550, line: 183)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !551, line: 30, baseType: !552)
!551 = !DIFile(filename: "/usr/include/sys/_types/_intptr_t.h", directory: "/Users/Stanislaw/Projects/LLVM/llvm/projects/mutang-project/lab/google_test/test_finder")
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !135, line: 49, baseType: !13)
!553 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !554, line: 184)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !555, line: 30, baseType: !16)
!555 = !DIFile(filename: "/usr/include/sys/_types/_uintptr_t.h", directory: "/Users/Stanislaw/Projects/LLVM/llvm/projects/mutang-project/lab/google_test/test_finder")
!556 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !557, line: 186)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !558, line: 32, baseType: !13)
!558 = !DIFile(filename: "/usr/include/_types/_intmax_t.h", directory: "/Users/Stanislaw/Projects/LLVM/llvm/projects/mutang-project/lab/google_test/test_finder")
!559 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !560, line: 187)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !561, line: 32, baseType: !16)
!561 = !DIFile(filename: "/usr/include/_types/_uintmax_t.h", directory: "/Users/Stanislaw/Projects/LLVM/llvm/projects/mutang-project/lab/google_test/test_finder")
!562 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !563, line: 52)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "nullptr_t", scope: !10, file: !564, line: 61, baseType: !565)
!564 = !DIFile(filename: "/usr/local/Cellar/llvm/3.9.1/bin/../include/c++/v1/__nullptr", directory: "/Users/Stanislaw/Projects/LLVM/llvm/projects/mutang-project/lab/google_test/test_finder")
!565 = !DIBasicType(tag: DW_TAG_unspecified_type, name: "decltype(nullptr)")
!566 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !567, line: 104)
!567 = !DISubprogram(name: "isalnum", linkageName: "_Z7isalnumi", scope: !568, file: !568, line: 212, type: !319, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!568 = !DIFile(filename: "/usr/include/ctype.h", directory: "/Users/Stanislaw/Projects/LLVM/llvm/projects/mutang-project/lab/google_test/test_finder")
!569 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !570, line: 105)
!570 = !DISubprogram(name: "isalpha", linkageName: "_Z7isalphai", scope: !568, file: !568, line: 218, type: !319, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!571 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !572, line: 106)
!572 = !DISubprogram(name: "isblank", linkageName: "_Z7isblanki", scope: !568, file: !568, line: 224, type: !319, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!573 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !574, line: 107)
!574 = !DISubprogram(name: "iscntrl", linkageName: "_Z7iscntrli", scope: !568, file: !568, line: 230, type: !319, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!575 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !576, line: 108)
!576 = !DISubprogram(name: "isdigit", linkageName: "_Z7isdigiti", scope: !568, file: !568, line: 237, type: !319, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!577 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !578, line: 109)
!578 = !DISubprogram(name: "isgraph", linkageName: "_Z7isgraphi", scope: !568, file: !568, line: 243, type: !319, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!579 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !580, line: 110)
!580 = !DISubprogram(name: "islower", linkageName: "_Z7isloweri", scope: !568, file: !568, line: 249, type: !319, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!581 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !582, line: 111)
!582 = !DISubprogram(name: "isprint", linkageName: "_Z7isprinti", scope: !568, file: !568, line: 255, type: !319, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!583 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !584, line: 112)
!584 = !DISubprogram(name: "ispunct", linkageName: "_Z7ispuncti", scope: !568, file: !568, line: 261, type: !319, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!585 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !586, line: 113)
!586 = !DISubprogram(name: "isspace", linkageName: "_Z7isspacei", scope: !568, file: !568, line: 267, type: !319, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!587 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !588, line: 114)
!588 = !DISubprogram(name: "isupper", linkageName: "_Z7isupperi", scope: !568, file: !568, line: 273, type: !319, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!589 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !590, line: 115)
!590 = !DISubprogram(name: "isxdigit", linkageName: "_Z8isxdigiti", scope: !568, file: !568, line: 280, type: !319, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!591 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !592, line: 116)
!592 = !DISubprogram(name: "tolower", linkageName: "_Z7toloweri", scope: !568, file: !568, line: 292, type: !319, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!593 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !594, line: 117)
!594 = !DISubprogram(name: "toupper", linkageName: "_Z7toupperi", scope: !568, file: !568, line: 298, type: !319, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!595 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !596, line: 63)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !597, line: 31, baseType: !598)
!597 = !DIFile(filename: "/usr/include/sys/_types/_wint_t.h", directory: "/Users/Stanislaw/Projects/LLVM/llvm/projects/mutang-project/lab/google_test/test_finder")
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wint_t", file: !135, line: 112, baseType: !51)
!599 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !600, line: 64)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctrans_t", file: !601, line: 31, baseType: !602)
!601 = !DIFile(filename: "/usr/include/_types/_wctrans_t.h", directory: "/Users/Stanislaw/Projects/LLVM/llvm/projects/mutang-project/lab/google_test/test_finder")
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctrans_t", file: !603, line: 40, baseType: !51)
!603 = !DIFile(filename: "/usr/include/_types.h", directory: "/Users/Stanislaw/Projects/LLVM/llvm/projects/mutang-project/lab/google_test/test_finder")
!604 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !605, line: 65)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctype_t", file: !606, line: 31, baseType: !607)
!606 = !DIFile(filename: "/usr/include/_types/_wctype_t.h", directory: "/Users/Stanislaw/Projects/LLVM/llvm/projects/mutang-project/lab/google_test/test_finder")
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctype_t", file: !603, line: 42, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !135, line: 45, baseType: !200)
!609 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !610, line: 66)
!610 = !DISubprogram(name: "iswalnum", linkageName: "_Z8iswalnumi", scope: !611, file: !611, line: 66, type: !612, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!611 = !DIFile(filename: "/usr/include/_wctype.h", directory: "/Users/Stanislaw/Projects/LLVM/llvm/projects/mutang-project/lab/google_test/test_finder")
!612 = !DISubroutineType(types: !613)
!613 = !{!51, !596}
!614 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !615, line: 67)
!615 = !DISubprogram(name: "iswalpha", linkageName: "_Z8iswalphai", scope: !611, file: !611, line: 72, type: !612, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!616 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !617, line: 68)
!617 = !DISubprogram(name: "iswblank", linkageName: "_Z8iswblanki", scope: !618, file: !618, line: 50, type: !612, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!618 = !DIFile(filename: "/usr/include/wctype.h", directory: "/Users/Stanislaw/Projects/LLVM/llvm/projects/mutang-project/lab/google_test/test_finder")
!619 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !620, line: 69)
!620 = !DISubprogram(name: "iswcntrl", linkageName: "_Z8iswcntrli", scope: !611, file: !611, line: 78, type: !612, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!621 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !622, line: 70)
!622 = !DISubprogram(name: "iswdigit", linkageName: "_Z8iswdigiti", scope: !611, file: !611, line: 90, type: !612, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!623 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !624, line: 71)
!624 = !DISubprogram(name: "iswgraph", linkageName: "_Z8iswgraphi", scope: !611, file: !611, line: 96, type: !612, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!625 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !626, line: 72)
!626 = !DISubprogram(name: "iswlower", linkageName: "_Z8iswloweri", scope: !611, file: !611, line: 102, type: !612, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!627 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !628, line: 73)
!628 = !DISubprogram(name: "iswprint", linkageName: "_Z8iswprinti", scope: !611, file: !611, line: 108, type: !612, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!629 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !630, line: 74)
!630 = !DISubprogram(name: "iswpunct", linkageName: "_Z8iswpuncti", scope: !611, file: !611, line: 114, type: !612, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!631 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !632, line: 75)
!632 = !DISubprogram(name: "iswspace", linkageName: "_Z8iswspacei", scope: !611, file: !611, line: 120, type: !612, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!633 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !634, line: 76)
!634 = !DISubprogram(name: "iswupper", linkageName: "_Z8iswupperi", scope: !611, file: !611, line: 126, type: !612, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!635 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !636, line: 77)
!636 = !DISubprogram(name: "iswxdigit", linkageName: "_Z9iswxdigiti", scope: !611, file: !611, line: 132, type: !612, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!637 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !638, line: 78)
!638 = !DISubprogram(name: "iswctype", linkageName: "_Z8iswctypeij", scope: !611, file: !611, line: 84, type: !639, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!639 = !DISubroutineType(types: !640)
!640 = !{!51, !596, !605}
!641 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !642, line: 79)
!642 = !DISubprogram(name: "wctype", scope: !611, file: !611, line: 172, type: !643, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!643 = !DISubroutineType(types: !644)
!644 = !{!605, !37}
!645 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !646, line: 80)
!646 = !DISubprogram(name: "towlower", linkageName: "_Z8towloweri", scope: !611, file: !611, line: 138, type: !647, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!647 = !DISubroutineType(types: !648)
!648 = !{!596, !596}
!649 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !650, line: 81)
!650 = !DISubprogram(name: "towupper", linkageName: "_Z8towupperi", scope: !611, file: !611, line: 144, type: !647, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!651 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !652, line: 82)
!652 = !DISubprogram(name: "towctrans", scope: !618, file: !618, line: 121, type: !653, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!653 = !DISubroutineType(types: !654)
!654 = !{!596, !596, !600}
!655 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !656, line: 83)
!656 = !DISubprogram(name: "wctrans", scope: !618, file: !618, line: 123, type: !657, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!657 = !DISubroutineType(types: !658)
!658 = !{!600, !37}
!659 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !660, line: 116)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !661, line: 31, baseType: !662)
!661 = !DIFile(filename: "/usr/include/sys/_types/_mbstate_t.h", directory: "/Users/Stanislaw/Projects/LLVM/llvm/projects/mutang-project/lab/google_test/test_finder")
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mbstate_t", file: !135, line: 81, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !135, line: 79, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !135, line: 76, size: 1024, align: 64, elements: !665, identifier: "_ZTS11__mbstate_t")
!665 = !{!666, !670}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !664, file: !135, line: 77, baseType: !667, size: 1024, align: 8)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 1024, align: 8, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !664, file: !135, line: 78, baseType: !136, size: 64, align: 64)
!671 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !15, line: 117)
!672 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !673, line: 118)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !674, line: 73, size: 448, align: 64, elements: !675, identifier: "_ZTS2tm")
!674 = !DIFile(filename: "/usr/include/time.h", directory: "/Users/Stanislaw/Projects/LLVM/llvm/projects/mutang-project/lab/google_test/test_finder")
!675 = !{!676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !673, file: !674, line: 74, baseType: !51, size: 32, align: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !673, file: !674, line: 75, baseType: !51, size: 32, align: 32, offset: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !673, file: !674, line: 76, baseType: !51, size: 32, align: 32, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !673, file: !674, line: 77, baseType: !51, size: 32, align: 32, offset: 96)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !673, file: !674, line: 78, baseType: !51, size: 32, align: 32, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !673, file: !674, line: 79, baseType: !51, size: 32, align: 32, offset: 160)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !673, file: !674, line: 80, baseType: !51, size: 32, align: 32, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !673, file: !674, line: 81, baseType: !51, size: 32, align: 32, offset: 224)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !673, file: !674, line: 82, baseType: !51, size: 32, align: 32, offset: 256)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !673, file: !674, line: 83, baseType: !13, size: 64, align: 64, offset: 320)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !673, file: !674, line: 84, baseType: !35, size: 64, align: 64, offset: 384)
!687 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !596, line: 119)
!688 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !100, line: 120)
!689 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !690, line: 121)
!690 = !DISubprogram(name: "fwprintf", scope: !691, file: !691, line: 103, type: !692, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!691 = !DIFile(filename: "/usr/include/wchar.h", directory: "/Users/Stanislaw/Projects/LLVM/llvm/projects/mutang-project/lab/google_test/test_finder")
!692 = !DISubroutineType(types: !693)
!693 = !{!51, !163, !488, null}
!694 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !695, line: 122)
!695 = !DISubprogram(name: "fwscanf", scope: !691, file: !691, line: 104, type: !692, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!696 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !697, line: 123)
!697 = !DISubprogram(name: "swprintf", scope: !691, file: !691, line: 115, type: !698, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!698 = !DISubroutineType(types: !699)
!699 = !{!51, !474, !15, !488, null}
!700 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !701, line: 124)
!701 = !DISubprogram(name: "vfwprintf", scope: !691, file: !691, line: 118, type: !702, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!702 = !DISubroutineType(types: !703)
!703 = !{!51, !163, !488, !196}
!704 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !705, line: 125)
!705 = !DISubprogram(name: "vswprintf", scope: !691, file: !691, line: 120, type: !706, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!706 = !DISubroutineType(types: !707)
!707 = !{!51, !474, !15, !488, !196}
!708 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !709, line: 127)
!709 = !DISubprogram(name: "swscanf", scope: !691, file: !691, line: 116, type: !710, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!710 = !DISubroutineType(types: !711)
!711 = !{!51, !488, !488, null}
!712 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !713, line: 128)
!713 = !DISubprogram(name: "vfwscanf", scope: !691, file: !691, line: 170, type: !702, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!714 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !715, line: 129)
!715 = !DISubprogram(name: "vswscanf", scope: !691, file: !691, line: 172, type: !716, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!716 = !DISubroutineType(types: !717)
!717 = !{!51, !488, !488, !196}
!718 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !719, line: 131)
!719 = !DISubprogram(name: "fgetwc", scope: !691, file: !691, line: 98, type: !720, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!720 = !DISubroutineType(types: !721)
!721 = !{!596, !163}
!722 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !723, line: 132)
!723 = !DISubprogram(name: "fgetws", scope: !691, file: !691, line: 99, type: !724, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!724 = !DISubroutineType(types: !725)
!725 = !{!474, !474, !51, !163}
!726 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !8, entity: !727, line: 133)
!727 = !DISubprogram(name: "fputwc", scope: !691, file: !691, line: 100, type: !728, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!728 = !DISubroutineType(types: !729)
!729 = !{!596, !475, !163}
